devdnl/dnx-rtos/src/system/drivers/uart/stm32f1/uart.c
        int result = sys_mutex_lock(hdl->port_lock_rx_mtx, MTX_BLOCK_TIMEOUT);
        if (result == ESUCC) {
                *rdcnt = 0;

                while (count--) {
                        result = sys_semaphore_wait(hdl->data_read_sem, RX_WAIT_TIMEOUT);
                        if (result == ESUCC) {
                                CLEAR_BIT(UART[hdl->major].UART->CR1, USART_CR1_RXNEIE);
                                if (FIFO_read(&hdl->Rx_FIFO, dst)) {
                                        dst++;
                                        (*rdcnt)++;
                                }
                                SET_BIT(UART[hdl->major].UART->CR1, USART_CR1_RXNEIE);
                        }
                }

                sys_mutex_unlock(hdl->port_lock_rx_mtx);
        }

        return result;
}

//==============================================================================
/**
 * @brief IO control
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_IOCTL(UART, void *device_handle, int request, void *arg)
{
        struct UART_mem *hdl    = device_handle;
        int              result = EINVAL;

        if (arg) {
                switch (request) {
                case IOCTL_UART__SET_CONFIGURATION:
                        UART_configure(hdl->major, arg);
                        hdl->config = *cast(struct UART_config *, arg);
                        result = ESUCC;
                        break;

                case IOCTL_UART__GET_CONFIGURATION:
                        *cast(struct UART_config *, arg) = hdl->config;
                        result = ESUCC;
                        break;

                case IOCTL_UART__GET_CHAR_UNBLOCKING:
                        if (!FIFO_read(&hdl->Rx_FIFO, arg)) {
                                result = EAGAIN;
                        } else {
                                result = ESUCC;
                        }
                        break;

                default:
                        result = EBADRQC;
                        break;
                }
        }

        return result;
}

//==============================================================================
/**
 * @brief Flush device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_FLUSH(UART, void *device_handle)
{
        UNUSED_ARG1(device_handle);

        return ESUCC;
}

//==============================================================================
/**
 * @brief Device information
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_STAT(UART, void *device_handle, struct vfs_dev_stat *device_stat)
{
        struct UART_mem *hdl = device_handle;

        device_stat->st_size  = 0;
        device_stat->st_major = hdl->major;
        device_stat->st_minor = 0;

        return ESUCC;
}

//==============================================================================
/**
 * @brief Function enable USART clock
 *
 * @param[in] UART              UART registers
 *
 * @return One of errno value
 */
//==============================================================================
static int UART_turn_on(const UART_regs_t *UART)
{
        if (!(*UART->APBENR & UART->APBENR_UARTEN)) {
                SET_BIT(*UART->APBRSTR, UART->APBRSTR_UARTRST);
                CLEAR_BIT(*UART->APBRSTR, UART->APBRSTR_UARTRST);
                SET_BIT(*UART->APBENR, UART->APBENR_UARTEN);
                return ESUCC;
        } else {
                return EADDRINUSE;
        }
}

//==============================================================================
/**
 * @brief Function disable USART clock
 *
 * @param[in] UART              UART registers
 *
 * @return One of errno value.
 */
//==============================================================================
static int UART_turn_off(const UART_regs_t *UART)
{
        NVIC_DisableIRQ(UART->IRQn);
        SET_BIT(*UART->APBRSTR, UART->APBRSTR_UARTRST);
        CLEAR_BIT(*UART->APBRSTR, UART->APBRSTR_UARTRST);
        CLEAR_BIT(*UART->APBENR, UART->APBENR_UARTEN);
        return ESUCC;
}

//==============================================================================
/**
 * @brief Function configure selected UART
 *
 * @param major         major device number
 * @param config        configuration structure
 */
//==============================================================================
static void UART_configure(u8_t major, const struct UART_config *config)
{
        const UART_regs_t *DEV = &UART[major];

        /* set baud */
        RCC_ClocksTypeDef freq;
        RCC_GetClocksFreq(&freq);

        u32_t PCLK = (DEV->UART == USART1) ? freq.PCLK2_Frequency : freq.PCLK1_Frequency;

        DEV->UART->BRR = (PCLK / (config->baud)) + 1;

        /* set 8 bit word length and wake idle line */
        CLEAR_BIT(DEV->UART->CR1, USART_CR1_M | USART_CR1_WAKE);

        /* set parity */
        switch (config->parity) {
        case UART_PARITY__OFF:
                CLEAR_BIT(DEV->UART->CR1, USART_CR1_PCE);
                break;
        case UART_PARITY__EVEN:
                SET_BIT(DEV->UART->CR1, USART_CR1_PCE);
                CLEAR_BIT(DEV->UART->CR1, USART_CR1_PS);
                break;
        case UART_PARITY__ODD:
                SET_BIT(DEV->UART->CR1, USART_CR1_PCE);
                SET_BIT(DEV->UART->CR1, USART_CR1_PS);
                break;
        }

        /* transmitter enable */
        if (config->tx_enable) {
                SET_BIT(DEV->UART->CR1, USART_CR1_TE);
        } else {
                CLEAR_BIT(DEV->UART->CR1, USART_CR1_TE);
        }

